INSERT INTO owners (full_name) VALUES
('Иванов Иван Иванович'),
('Петров Петр Петрович'),
('Сидорова Анна Михайловна'),
('Козлов Дмитрий Сергеевич'),
('Николаева Екатерина Владимировна'),
('Федоров Алексей Борисович'),
('Морозова Ольга Дмитриевна'),
('Волков Сергей Павлович'),
('Захарова Марина Игоревна'),
('Белов Андрей Николаевич');

INSERT INTO parking_spaces (number, is_available) VALUES
('A-01', true),
('A-02', true),
('A-03', true),
('A-04', true),
('A-05', true),
('A-06', true),
('B-01', false),
('B-02', false),
('B-03', false),
('B-04', false),
('V-01', true),
('V-02', true),
('V-03', true),
('E-01', true),
('E-02', true),
('E-03', true),
('C-01', false),
('C-02', false),
('C-03', false),
('C-04', false);

INSERT INTO cars (number, owner_id) VALUES
('А123ВС161', 1),
('В456ОР126', 1),
('С789ТУ777', 2),
('Е001КХ777', 3),
('М123АВ777', 4),
('Н456СВ777', 5),
('О789РТ761', 6),
('Р123УК777', 6),
('Т456МН23', 7),
('Х789ВА23', 8),
('У123СТ26', 9),
('А456РР777', 10);

INSERT INTO bookings (car_id, space_id, is_paid) VALUES
(1, 7, false),
(2, 8, false),
(3, 9, false),
(4, 10, false),
(5, 17, true),
(6, 18, true);
